import styles from "#/styles/page/terms.module.scss";
import { FC } from "react";

const TermsPage: FC = () => {
  return (
    <div className={styles.container}>
      <h2>Yakjung 이용약관</h2>
      <div>
        <span>
          <a href="#제1조【총칙】">제1조【총칙】</a>
        </span>
        <span>
          <a href="#제2조【정의】">제2조【정의】</a>
        </span>
        <span>
          <a href="#제3조【금지사항】">제3조【금지사항】</a>
        </span>
        <span>
          <a href="#제4조【본사의 권한】">제4조【본사의 권한】</a>
        </span>
        <span>
          <a href="#제5조【개인정보】">제5조【개인정보】</a>
        </span>
        <span>
          <a href="#제6조【저작권 및 지적재산권】">
            제6조【저작권 및 지적재산권】
          </a>
        </span>
        <span>
          <a href="#제7조【면책조항】">제7조【면책조항】</a>
        </span>
        <span>
          <a href="#제8조【계정자격의 취득】">제8조【계정자격의 취득】</a>
        </span>
        <span>
          <a href="#제9조【계정의 관리와 탈퇴】">제9조【계정의 관리와 탈퇴】</a>
        </span>
        <span>
          <a href="#제10조【계정자격의 제한】">제10조【계정자격의 제한】</a>
        </span>
        <span>
          <a href="#제11조【이용료】">제11조【이용료】</a>
        </span>
        <span>
          <a href="#제12조【본 사이트의 삭제 및 삭제권한】">
            제12조【본 사이트의 삭제 및 삭제권한】
          </a>
        </span>
        <span>
          <a href="#제13조【본 이용약관의 위반행위 등에 대한 대처】">
            제13조【본 이용약관의 위반행위 등에 대한 대처】
          </a>
        </span>
      </div>
      <h3 id="제1조【총칙】">제1조【총칙】</h3>
      <ol>
        <li>
          본 이용약관(이하 '본 이용약관'이라 합니다.)은 본 웹사이트
          'Yakjung'(이하 '본 사이트'라 합니다.)에서 제공하는 서비스를 사용자가
          이용할 때의 모든 행위에 적용됩니다.
        </li>
        <li>
          본 이용약관은 본 서비스의 이용 조건을 정합니다. 사용자는 본 이용약관을
          준수하여 본 서비스를 이용해야 합니다.
        </li>
        <li>
          본 사이트는 사용자 간 의견 교환의 장으로서 본사에 의해 개설 및
          운영됩니다. 사용자는 이러한 취지를 이해한 후에 본 서비스를 이용해야
          합니다.
        </li>
        <li>
          사용자는 본 서비스를 이용함으로써 본 이용약관의 모든 내용에 동의한
          것으로 간주됩니다.
        </li>
        <li>
          본 약관은 사전 통지, 사용자의 동의 없이 언제든지 변경될 수 있으며,
          변경 후의 약관은 본 서비스 화면에 게시된 시점부터 효력을 발생하며
          사용자는 이에 따라야 합니다.
        </li>
      </ol>
      <h3 id="제2조【정의】">제2조【정의】</h3>
      <ol>
        <li>본 이용약관에서 사용하는 용어의 의미는 다음 각 호와 같습니다.</li>
        <ol>
          <li>
            본 사이트, 본사: 웹사이트 'Yakjung' (https://yakjung.site/)를
            의미합니다.
          </li>
          <li>본 서비스: 본 사이트에서 제공되는 모든 서비스를 의미합니다.</li>
          <li>사용자: 본 사이트를 접속한 사람을 의미합니다.</li>
          <li>계정: 본 사이트에 계정을 등록한 사람을 의미합니다.</li>
          <li>
            게시물: 텍스트, URL, 이미지, 동영상 등 본 서비스를 통해 게시할 수
            있는 정보를 의미합니다.
          </li>
          <li>
            댓글: 텍스트, URL 등 본 서비스를 통해 댓글을 작성할 수 있는 정보를
            의미합니다.
          </li>
        </ol>
      </ol>
      <h3 id="제3조【금지사항】">제3조【금지사항】</h3>
      <ol>
        <li>
          이용자는 본 서비스 이용 시 다음에 기재된 행위를 해서는 안 됩니다.
          금지사항에 위반할 경우 접속 제한 조치, 게시 금지 조치, 댓글 등 정보의
          전부 또는 일부 삭제, 또는 공개 범위 변경 등 불리한 조치가 취해질 수
          있습니다.
        </li>
        <ol>
          <li>
            본 사이트 또는 타인의 저작권, 상표권 등의 지적 재산권을 침해하는
            행위 또는 침해할 우려가 있는 행위.
          </li>
          <li>
            본 사이트 또는 타인의 재산, 개인 정보, 초상권을 침해하는 행위 또는
            침해할 우려가 있는 행위.
          </li>
          <li>
            본 사이트 또는 타인을 부당하게 차별하거나 비방하며, 타인에게 부당한
            차별을 조장하거나 그 명예나 신용을 훼손하는 행위.
          </li>
          <li>
            본 사이트를 이용한 종교의 선전을 포함한 종교적 행위, 종교 단체의
            설립·활동, 종교 단체에 가입 등 종교적인 결사에 관한 행위.
          </li>
          <li>
            본인 이외의 사람을 가장하거나, 대표권이나 대리권이 없음에도 존재하는
            것처럼 가장하거나, 다른 사람이나 조직과 제휴, 협력 관계에 있다고
            거짓으로 주장하며 본 서비스를 이용하는 행위.
          </li>
          <li>
            사기, 규제 약물 남용, 아동 매매, 예·적금 계좌 및 휴대전화의 불법
            거래 등의 범죄에 연결되거나 연결될 우려가 있는 행위.
          </li>
          <li>
            음란, 아동 포르노에 해당하는 게시글, 댓글 등의 정보를 게시, 판매,
            광고 또는 표시하는 행위를 하는 것.
          </li>
          <li>
            식별할 수 없는 이성과의 만남 또는 청소년의 가출을 유인·조장하는 등의
            목적으로 이용하는 행위.
          </li>
          <li>
            채용 관련, 물품 거래 행위 등의 불법 행위 커뮤니티를 운영하는 행위.
          </li>
          <li>
            불법 행위(검열기, 폭발물 제조, 아동 포르노 제공, 공문서 위조, 살인,
            협박, 불법 도박 등)에 참여, 의뢰, 중개 또는 유인하는 행위.
          </li>
          <li>
            범죄 예고, 자살 유인 기타 타인을 위협·협박하는 내용이 의심스러운
            행위.
          </li>
          <li>
            잔혹행위(사람의 살해, 상해, 기타 잔인한 행위)에 또는 생리적으로
            불쾌감을 느끼는(그로테스크한 이미지, 오물의 이미지 등) 정보를
            게시하거나 표시하는 행위.
          </li>
          <li>
            상업적인 광고, 선전 또는 권유를 목적으로 하는 정보(얼리에이드, 금리
            담보대출, 체인 메일, 리드메일, 어덜트 사이트, 원클릭 사기 사이트,
            바이러스 등의 유해한 컴퓨터 프로그램 등을 유포하는 것을 목적으로
            하는 사이트 등), 그 밖에 본 사이트가 부적절하다고 판단하는 정보를
            게시하거나 표시하는 행위.
          </li>
          <li>
            본인 또는 제3자의 주소, 전화번호, 이메일 주소 등 개인이 특정되는
            연락처를 게시하는 행위.
          </li>
          <li>
            스팸 댓글, 스팸 게시물, 스팸 커뮤니티, 그 밖에 본 사이트가 스팸으로
            판단하는 행위로서 본 사이트의 정상적인 운영을 방해하는 행위.
          </li>
          <li>본 사이트의 설비에 불법적으로 수정하거나 삭제하는 행위.</li>
          <li>
            본 사이트 또는 타인의 서버에 부담을 주는 행위, 또는 본 서비스의
            운영이나 네트워크·시스템에 장애를 주거나 이러한 가능성이 있는 행위.
          </li>
          <li>
            법령, 공서양속 또는 본 이용약관에 위반하거나 타인의 권리를
            침해한다고 본 사이트가 판단하는 행위.
          </li>
        </ol>
        <li>
          이용자가 1의 금지행위를 행하고 본 사이트가 이로 인해 손해를 입은 경우,
          손해배상 청구를 합니다.
        </li>
      </ol>
      <h3 id="#제4조【본사의 권한】">제4조【본사의 권한】</h3>
      <ol>
        <li>
          본 사이트의 운영에 있어서, 본사는 다음과 같은 권한을 가지고 있습니다.
          단, 본 조항은 본사의 권리를 명시한 것일 뿐이며, 다음 각 항목 및
          이용자로부터의 삭제 요청이나 수정 요청에 대해 실행할 의무를 지지
          않습니다. 또한, 본 사이트는 본 조항에 명시된 권리의 행사로 인해
          발생하는 손해에 대해 일체의 책임을 지지 않습니다.
        </li>
        <li>
          해당 커뮤니티, 게시물, 댓글 등의 삭제 및 편집을 작성자의 동의 없이 할
          수 있는 권리, 그리고 해당 작성자에 대한 접근 거부 및 기타 필요한
          조치를 취할 수 있는 권리입니다.
        </li>
        <li>
          본 사이트의 게시 방법, 카테고리, 게시 기간 등과 관련된 모든 사항을
          결정하는 모든 편집 권한을 보유하며, 정보 등의 재분류, 카테고리의 통합,
          부적절한 카테고리에 게시된 정보 등의 이동 등을 할 수 있는 권리를
          가지고 있습니다.
        </li>
        <li>
          전항의 조치 이외에도 위반 행위로 인해 피해를 입은 제3자를 위해 수사
          기관에 통보 및 기타 당사가 필요하다고 판단하는 조치를 취할 수 있는
          권리입니다.
        </li>
        <li>
          이용자에 대한 사전 통지 또는 승인을 요하지 않고, 본 서비스를
          중단·종료할 수 있는 권리입니다.
        </li>
      </ol>
      <h3 id="제5조【개인정보】">제5조【개인 정보】</h3>
      <ol>
        <li>
          본 사이트는 이용자의 개인 정보를 존중합니다. 본사는 이용자로부터
          수집한 정보를 안전하게 관리하기 위해 보안에 최대한의 주의를 기울이고
          있습니다.
        </li>
        <li>
          본 사이트는 본 서비스 및 데이터의 내용의 정확성, 완전성, 안전성,
          유용성에 대해 어떠한 보증도 하지 않습니다. 이용자 자신의 책임 하에
          이용해 주십시오.
        </li>
      </ol>
      <h3 id="제6조【저작권 및 지적재산권】">제6조【저작권 및 지적 재산권】</h3>
      <ol>
        <li>
          본 사이트가 작성한 저작물에 관한 저작권 및 기타 지적 재산권은 본
          사이트에 귀속됩니다.
        </li>
        <li>
          본 사이트 내에 이용자가 게시한 정보는 저작권법에 따라 창작한
          사용자에게 귀속됩니다. 단, 본사는 서비스의 운영, 인용, 전시, 전송,
          배포, 홍보, 연구, 개발, 조사의 목적으로 이용자의 별도의 허락 없이
          무상으로 "저작권법"에 규정된 공정한 관행에 부합하는 범위 내에서 다음과
          같이 이용자가 등록한 커뮤니티, 댓글 또는 게시물을 사용할 수 있습니다.
        </li>
        <li>
          게시자는 본 사이트로의 게시에 관해 발생하는 책임이 모두 게시자에게
          귀속된다는 것을 동의한 후 작성합니다.
        </li>
        <li>
          본 약관에 정한 범위를 초과하여 데이터의 복제, 저장, 번역, 출판, 판매,
          송신, 대여 및 변경 등 본사 또는 제3자의 저작권, 상표권 등의 지적
          재산권을 침해하는 이용, 본사 또는 제3자의 재산, 개인 정보 및 기타
          권리를 침해하는 이용, 상기 각 사항에 해당하는 우려가 있는 이용, 기타
          본사가 부적절하다고 판단하는 이용, 이용자가 본 약관에 위반하여 본사에
          손해를 입힌 경우, 본사는 해당 이용자에게 손해 배상 청구를 할 수
          있습니다. 또한, 이용자가 본 서비스를 부정하게 이용하여 얻은 데이터 및
          그 복제물을 소유하는 경우, 이용자는 본사의 지시에 따라 이를 처리해야
          합니다.
        </li>
      </ol>

      <h3 id="제7조【면책조항】">제7조【면책조항】</h3>
      <ol>
        <li>
          본 사이트는 사용자 간의 통신 및 활동에 개입하지 않습니다. 만약 제3자
          간 또는 이용자 간의 문제 또는 분쟁이 발생할 경우, 해당 이용자 간의
          해결을 담당하며, 본 사이트는 그에 대한 책임을지지 않습니다. 또한, 본
          사이트에 어떠한 손해도 발생시키지 않는 것을 명시합니다.
        </li>
        <li>
          본 사이트는 이용료 청구를 하지 않습니다. 또한, 이로 인해 예기치 않은
          손해가 발생한 경우에도 본 사이트는 어떠한 책임도지지 않습니다.
        </li>
        <li>
          본 사이트는 사용자가 게시하는 게시물은 해당 작성자의 책임하에 게시된
          것으로, 게시물의 진실성, 적법성, 안전성, 적절성, 유용성, 도덕성,
          신뢰성, 정확성 등에 대한 정보를 감시하거나 어떠한 보증도 하지 않는
          의무를 지지 않습니다.
        </li>
        <li>
          본 사이트는 사용자가 게시하는 댓글 등의 정보의 진실성, 적법성, 안전성,
          적절성, 유용성, 도덕성, 신뢰성, 정확성에 대한 책임을 지지 않습니다.
          사용자가 게시하는 댓글 등의 정보를 감시하거나 본 사이트는 어떠한
          보증을 하는 의무를 지지 않습니다.
        </li>
        <li>
          본 사이트는 사용자에 의해 작성되는 커뮤니티는 작성한 사용자의 책임하에
          커뮤니티의 진실성, 적법성, 안전성, 적절성, 유용성, 도덕성, 신뢰성,
          정확성 등에 대해 커뮤니티 등의 정보를 감시하거나 본 사이트는 어떠한
          보증을 하는 의무를 지지 않습니다.
        </li>
        <li>
          금지 사항에 위반하는 어떠한 내용, 표현에 대해서도 그 존재 여부를
          보증하지 않으며, 또한 이로 인해 발생하는 어떠한 손해(정신적 고통, 사업
          중단 또는 기타 금전적 손실을 포함한 모든 불이익 등)에 대해서도 본
          사이트는 어떠한 책임도지지 않습니다.
        </li>
        <li>
          본 사이트는 본 이용약관에 위반하는 행위 또는 그럴 것으로 판단되는
          행위가 이루어진 경우, 해당 행위를 실시한 사용자의 접근 제한 조치,
          게시물 등록 제한 조치, 사용자 삭제 조치, 댓글 등의 정보 전부 또는 일부
          삭제, 및 공개 범위 변경 등을 할 수 있습니다. 그러나 이로 인해 발생하는
          어떠한 손해에 대해서도 어떠한 책임도지지 않습니다.
        </li>
        <li>
          본 사이트는 본 서비스의 내용 추가, 변경 또는 본 서비스의 중단, 종료로
          인해 발생하는 어떠한 손해에 대해서도 접속 과다, 기타 예기치 않은
          요인으로 인한 표시 속도 저하 또는 장애 등이 발생한 경우에도 마찬가지로
          어떠한 책임도지지 않습니다.
        </li>
        <li>
          본 사이트에서 제3자의 발언으로 인해 발생하는 어떠한 손해에 대해서도
          책임을지지 않습니다.
        </li>
      </ol>
      <h3 id="제8조【계정자격의 취득】">제8조【계정자격의 취득】</h3>
      <ol>
        <li>
          본 사이트의 특정 기능을 사용하기 위해서는 yakjung 계정을 생성하고
          개인정보 보호 정책에 명시된대로 사용자의 이메일, 비밀번호, 기타 특정
          정보를 제공해야 합니다.
        </li>
        <li>
          계정 등록을 희망하는 사용자는 본 규정을 승인해야 하며, 본 사이트가
          지정한 절차에 따라 계정 등록을 완료한 시점에서 회원이 됩니다.
        </li>
      </ol>
      <h3 id="제9조【계정의 관리와 탈퇴】">제9조【계정의 관리와 탈퇴】</h3>
      <ol>
        <li>
          이용자는 자신의 계정에 관한 정보와 해당 계정으로 발생하는 모든 사항에
          대해 전적으로 책임을 집니다.
        </li>
        <li>
          이용자는 계정의 보안을 유지하고, 계정에만 사용되는 강력한 비밀번호를
          사용하는 것을 권장합니다.
        </li>
        <li>
          다른 이용자의 계정 도용, 다른 이용자 및 제3자의 개인정보를 동의 없이
          수집, 저장, 공개하는 등의 개인정보 침해 행위 및 명예 훼손을 하는 행위
        </li>
        <li>
          이용자는 본 사이트의 서면에 의한 사전 승인 없이 계정을 라이선스, 판매,
          양도할 수 없습니다.
        </li>
        <li>
          계정을 소지한 이용자는 본 사이트에서 언제든지 보유한 계정의 탈퇴를
          요청할 수 있으며, 본 사이트는 위 요청이 있을 경우 즉시 해당 계정의
          탈퇴 절차를 진행합니다.
        </li>
        <li>
          계정 탈퇴 후에는 계정 정보가 백업 데이터베이스에 6개월 보관되며, 그 후
          삭제됩니다. 커뮤니티, 댓글, 게시물 등은 삭제되지 않습니다. (탈퇴 시에
          게시물, 댓글 등으로 등록된 내용은 자동으로 삭제되지 않으므로, 삭제를
          희망하는 경우 탈퇴하기 전에 반드시 로그인 후 게시물을 삭제해주십시오.)
        </li>
      </ol>
      <h3 id="제10조【계정자격의 제한】">제10조【계정자격의 제한】</h3>
      <ol>
        <li>
          계정 이용자가 다음 각 호에 해당하는 경우, 본 사이트는 적절한 방법으로
          계정 자격을 제한, 중지, 상실시킬 수 있습니다.
        </li>
        <ol>
          <li>
            본 서비스의 이용 목적이 공서양속에 반하는 것으로 판단된 경우, 계정
            등록할 수 없습니다.
          </li>
          <li>계정 등록 시에 허위의 내용을 등록한 경우</li>
          <li>
            타인의 서비스 이용을 방해하거나, 그 정보를 도용하는 등 전자거래
            질서를 위협하는 경우
          </li>
        </ol>
        <li>
          전항에 위반한 경우, 본 사이트는 위반한 이용자에게 즉시 계정을 삭제할
          수 있습니다.
        </li>
        <li>
          전항의 삭제로 인해 본 사이트는 어떠한 손해배상 책임도 지지 않습니다.
        </li>
      </ol>
      <h3 id="제11조【이용료】">제11조【이용료】</h3>
      <ol>
        <li>
          본 사이트 및 본 서비스는 무료입니다. 다만, 통신비(인터넷 요금, 휴대폰
          데이터 요금 등)는 사용자 부담입니다.
        </li>
      </ol>
      <h3 id="제12조【본 사이트의 삭제 및 삭제권한】">
        제12조【본 사이트의 삭제 및 삭제권한】
      </h3>
      <ol>
        <li>
          본 사이트의 삭제 요청은 문의 페이지에서 삭제 사유와 답신용 이메일을
          기재한 후 요청해주십시오. 삭제는 이용 약관에 위반되거나 본 사이트의
          판단에 따릅니다.
        </li>
        <li>
          본 사이트는 커뮤니티, 게시물, 댓글, 계정 등의 정보에 대해 불법성, 약관
          위반 여부와 관계없이 관련 정보의 전부 또는 일부를 삭제하거나 공개
          범위를 변경하는 등 불리한 조치를 취할 수 있습니다.
        </li>
        <li>
          사람(실제인인지 여부와 관계없이 만화·애니메이션 등의 캐릭터를
          포함합니다)의 누드(옷의 전부 또는 일부가 없는 것을 말합니다)를
          촬영·묘사한 커뮤니티, 게시물, 댓글, 계정 등의 정보가 게시된 경우,
          공공기관이나 전문가(국가, 지방공공단체, 특정 전기통신업무제공자의
          손해배상책임제한 및 발신자정보의 공개에 관한 법률 가이드라인에 규정된
          신뢰성확인기구, 인터넷·핫라인센터, 변호사 등)로부터 커뮤니티, 게시물,
          댓글, 계정 등의 정보에 대해 불법, 공서양속에 위배되거나 타인의 권리를
          침해하는 등의 지적·의견 표명이 있는 경우, 권리자로 주장하는 자로부터
          커뮤니티, 게시물, 댓글, 계정 등의 정보가 자신의 권리를 침해한다는
          내용의 신고가 있는 경우, 권리자로 주장하는 자로부터 권리자임을
          합리적으로 판단할 수 있는 자료를 제시받아 본 사이트에서 심사한 결과에
          한정합니다.
        </li>
      </ol>
      <h3 id="제13조【본 이용약관의 위반행위 등에 대한 대처】">
        제13조【본 이용약관의 위반행위 등에 대한 대처】
      </h3>
      <ol>
        <li>
          본 약관에 위반하는 행위를 발견한 경우 문의 페이지를 통해
          문의해주십시오.
        </li>
        <li>
          사용자가 본 이용약관에 위반한 것으로 인정되는 경우, 본 사이트가
          필요하다고 인정하는 경우, 본 사이트는 해당 사용자에 대해 다음 조치를
          취할 수 있습니다.
        </li>
        <ol>
          <li>
            본 이용약관에 위반하는 행위 등을 중단하고, 동일한 행위를 반복하지
            않도록 요구하는 것입니다.
          </li>
          <li>
            게시물, 댓글, 커뮤니티, 사용자 등의 정보를 전부 또는 일부 삭제하고,
            공개 범위를 변경하거나 열람할 수 없는 상태(비공개)로 만듭니다.
          </li>
          <li>접근 금지 조치 IP 주소 차단 등의 조치를 취합니다.</li>
          <li>
            IP 주소 등의 접속원 정보를 기반으로 관련 기관과 협력하여 법적 조치를
            취할 수 있습니다.
          </li>
        </ol>
        <li>
          이용자는 본 사이트가 제3조 또는 본 이용약관 규정에 따라 실시한
          위반하는 행위 등에 대해 이의를 제기할 수 없습니다.
        </li>
      </ol>
      <span>
        본 약관 시행 이전에 이용자가 수행한 행위에 대해서도 본 약관이
        적용됩니다.
      </span>
      <span style={{ textAlign: "right" }}>2023년6월7일개정</span>
    </div>
  );
};

export default TermsPage;
